package by.itAcademy.homeworks.patterns;

public class Task67 {

    /**Task67
     * Создайте простейший сервис с методом, который выводит на экран текущую дату.
     * Сделайте его Singleton и используйте в основном телепрограммы.
     */
    public static void main(String[] args) {
<<<<<<< HEAD
        System.out.println(MySingleton.getExample().getLd());
=======
        System.out.println(MySingleton.example);
>>>>>>> cf6323eb23165e56ff2e7b3b8ca7f1e15b56c1fe
    }
}
