package by.itAcademy.homeworks.basics;
/* Задание:
1. запустить убедится, что работает.
2. внести хоть какие-то изменения, которые меняют результат. и заставить это работать.
* */

public class Task1 {
    public static void main(String[] args) {
        System.out.println("HelloWorld.java");
    }
}
