package by.itAcademy.homeworks.basics;

import by.itAcademy.interfaces.basics.ITask3;

/** Задание 3
 *
 * К основному сообщению из task2 добавить "I like java!", откомпилировать, запустить.
 */

public class Task3 implements ITask3 {
    public static void main(String[] args) {
        System.out.println("Hello Belarus!" + " I like java!");
    }
}
