package by.itAcademy.homeworks.sample;

/* Задание:
1. запустить убедится, что работает.
2. внести хоть какие-то изменения, которые меняют результат. и заставить это работать.
* */

public class sample1 {
    public static void main(String[] arg){
        int i=10;
        System.out.println("Hello"+i);
    }
}
