package by.itAcademy.homeworks.arrays;
//Создайте переменную для массива из 10 элементов. Заполните его произвольными значениями целочисленного типа и выведите последний элемент массива на экран.
public class Task18 {
    public static void main(String[] args) {
        int array[]={1,2,3,4,5,6,7,8,8,9};
        System.out.println(array[9]);
    }
}
