/*Написать метод, который выводит расписание на неделю.
 Задать на вход в метод порядковый номер дня недели и отобразить на экране то, что запланировано на этот день.*/

package by.itAcademy.homeworks.operators;

import java.util.Scanner;

public class Task11 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите номер дня недели: ");
        int num = sc.nextInt();
        timeTable(num);
    }

    public static void timeTable(int num){
        switch (num){
            case 1 :
                System.out.println("Понедельник");
                break;
            case 2 :
                System.out.println("Вторник");
                break;
            case 3 :
                System.out.println("Среда");
                break;
            case 4:
                System.out.println("Четверг");
                break;
            case 5:
                System.out.println("Пятница");
                break;
            case 6 :
                System.out.println("Суббота");
                break;
            case 7 :
                System.out.println("Воскресенье");
                break;
            default:
                System.out.println("Вы ввели некорректный день");
                break;
        }
    }
}
